[
    {
        "title": "Multilane BERT Product line",
        "description": "Using 3DS Max and Vray, coupled with a custom made materials library compiled in Connecter, I built my first 3D environment for Multilane. Using After Effects to blend in 2.5D Callouts with motion tracking, the aim was to showcase the multitude of products in the Bit Error Rate Tester line and their various features. Compiled and mastered in Premiere Pro, a fitting background track and the voice overs were introduced. Sfx were also applied to accompany the dynamic elements, including the metal doors and the popping of the callouts.",
        "shortDescription": "A tech-centric video made from the ground up in 3DS Max with Vray, After Effects and Premiere Pro",
        "video": "media/videos/BERT_video.mp4",
        "imagesFolder": "media/images/MultilaneBERT",
        "imageCount": 4
    },
    {
        "title": "Product Unveil - ML7004-FL",
        "description": "An elegant reveal of a top-of-the-line product built and animated in 3DS Max with Vray, and composed in Premiere Pro",
        "shortDescription": "An elegant reveal of a top-of-the-line product built and animated in 3DS Max with Vray, and composed in Premiere Pro",
        "video": "media/videos/MWTP_MW7004F-L_Reveal.mp4",
        "imagesFolder": "media/images/MWTP_MW7004F-L_Reveal",
        "imageCount": 1
    },
    {
        "title": "Christmas 2024 at Multilane",
        "description": "A reproduction of the Multilane Campus in 3D, with a twist. Enjoy this animation made in 3DS Max using Vray and SnowPlus creating a very special snow globe.",
        "shortDescription": "A reproduction of the Multilane Campus in 3D, with a twist.",
        "video": "media/videos/Christmas2024_WA.mp4"
    },
    {
        "title": "Christmas 2024 Backdrop",
        "description": "A custom made motion graphics backdrop video (initially 15 minutes long) for the 2024 Christmas gala dinner made in Illustrator and After Effects, also using the following plugins: Video Copilot's Optical Flares and Saber, Maxon's RG Trapcode",
        "shortDescription": "A custom motion graphics backdrop of the 2024 Christmas gala dinner",
        "video": "media/videos/Christmas2024-Screen-Visual.mp4"
    },
    {
        "title": "Switch Temperature Chamber",
        "description": "This scene was modeled from scratch in 3DS Max to showcase the switch racks in the two temperature chambers. The elements were crafted manually to mirror real life size, look, and feel",
        "shortDescription": "A 3D environment built from scratch in 3DS Max and Vray.",
        "video": "media/videos/Temperature_Chamber.mp4",
        "imagesFolder": "media/images/ML_TempChamb",
        "imageCount": 3
    },
    {
        "title": "Guest House Inauguration",
        "description": "An inauguration video for a newly finished guest house compiled and edited in Premiere Pro and After Effects.",
        "shortDescription": "An inauguration video for a newly finished guest house compiled and edited in Premiere Pro and After Effects",
        "video": "media/videos/bloca-compressed-v2.0.mp4"
    }
]
  
