[
    {
        "title": "Announcing an Industry Defining Product",
        "description": "For this one, the mission was to go above and beyond. Using 3DS Max for modeling and animation, Vray for the materials and lighting, PhoenixFD for the smoke dynamics and physics, with After Effects for the post-rendering effects. Compiled in Premiere Pro where all the SFX magic was done, blending visual progress and sound cues to reflect the progression of the video.",
        "shortDescription": "A technical showcase with emotional resonance — where every pixel, light beam, and sound cue speaks to the watcher",
        "video": "https://www.youtube.com/embed/CaAst77ZhnQ?si=jhsjn0DkOiP1wvSA"
    },
    {
        "title": "Backdrop Logo Animation for DJ Mincer's Set",
        "description": "Dynamic logo animation crafted in 3DS Max with PhoenixFD for the smoke animation, and After Effect with the Maxon Red Giant plugin for the subsequent effect. It was all synced to Mincer's very own music for a seamless experience.",
        "shortDescription": "A visually stunning logo animation for DJ Mincer",
        "video": "https://www.youtube.com/embed/EBKsAqjBEIQ?si=hqDTwHp1kv63Frst"
    },
    {
        "title": "CODENAME:THOR Teaser",
        "description": "This short - and highly technical - teaser presents effects made inside 3DS Max using TyFlow for the particle physics used for lightning and PhoenixFD for the clouds and smoke simulation. A fitting soundtrack was curated to fully convey the vibe of the video, while injecting key SFX elements to sell the ambience.",
        "shortDescription": "A short teaser featuring particle physics, a smoke simulation, and the smoothest transition one could ever witness.",
        "video": "https://www.youtube.com/embed/snaMHfspOeY?si=jTOvqYFhKTQOTVJX"
    },
    {
        "title": "Award Winning Announcement",
        "description": "Using 3DS Max for modeling and animation, Vray for the materials and lighting, and PhoenixFD for the smoke dynamics and physics, led to this feature-filled short video being born. Post editing was done in After Effects, where Optical flares were put to elevate the experience. Finally, it was mastered in Premiere Pro where the disruptive-sounding soundtrack and the intricate SFX were crafted to reflect the groundbreaking nature of this revolutionary product.",
        "shortDescription": "A groundbreaking animation featuring intricate sound and lighting, in addition to fluid dynamics",
        "video": "https://www.youtube.com/embed/-RMyT_AYkL4?si=8PZ2M0_sKzQcEyBA",
        "imagesFolder": "media/images/ML_MW7004FL_NeoFog/project-imgs",
        "imageCount": 5
    },
    {
        "title": "Major Convention Teaser Video",
        "description": "A teaser aimed at giving a glance of the products that will be on display at the convention. We opted for a selectively lit metal environment with mysterious pillars of light adding to the ambience. Using 3DS Max for modeling and animation, Vray for the materials and lighting, and PhoenixFD for the smoke dynamics and physics. Post and compositing in After Effects, mastered in Premiere Pro.",
        "shortDescription": "A teaser aimed at giving a mysterious glance of the products that will be on display at the convention.",
        "video": "https://www.youtube.com/embed/wlgaLcXIJdE?si=Z1DoyLOAZwqCJgCg"
    },
    {
        "title": "MultiLane Summer Gathering Edit 2025",
        "description": "An energetic and dynamic edit of FPV drone footage for the 2025 Summer Gathering at MultiLane. Programs used are After Effects and Premiere Pro.",
        "shortDescription": "An energetic and dynamic edit of FPV drone footage for the 2025 Summer Gathering at MultiLane",
        "video": "https://www.youtube.com/embed/mKw57Sw3_ZA?si=05Wa54rmbdzVZS9V"
    },
    {
        "title": "Product Unveil - ML7004-FL",
        "description": "An elegant reveal of a top-of-the-line product built and animated in 3DS Max with Vray, and composed in Premiere Pro",
        "shortDescription": "An elegant reveal of a top-of-the-line product built and animated in 3DS Max with Vray, and composed in Premiere Pro",
        "video": "https://www.youtube.com/embed/ViQW5RLbOwM?si=VfT-VlrWpLzaxbi-",
        "imagesFolder": "media/images/ML_MW7004FL_Reveal/project-imgs",
        "imageCount": 1
    },
    {
        "title": "Christmas 2024 at Multilane",
        "description": "A reproduction of the Multilane Campus in 3D, with a twist. Enjoy this animation made in 3DS Max using Vray and SnowPlus creating a very special snow globe.",
        "shortDescription": "A reproduction of the Multilane Campus in 3D, with a twist",
        "video": "https://www.youtube.com/embed/gPWRVfgWzbA?si=54m2IC6ELtfflFMw"
    },
    {
        "title": "Christmas 2024 Backdrop",
        "description": "A custom made motion graphics backdrop video (initially 15 minutes long) for the 2024 Christmas gala dinner made in Illustrator and After Effects, also using the following plugins: Video Copilot's Optical Flares and Saber, Maxon's RG Trapcode",
        "shortDescription": "A custom motion graphics backdrop of the 2024 Christmas gala dinner",
        "video": "https://www.youtube.com/embed/6h-3SaBS3h8?si=E0PYg6i7-azFVNpB"
    }
]



